n=7
# graph = [[0,1,1,0,1,0,0]
# [0,1,1,0,1,0,1]
# [1,1,1,0,1,0,1]
# [0,0,0,0,1,1,1]
# [0,1,0,0,0,0,0]
# [0,1,1,1,1,1,0]
# [0,1,1,1,0,0,0]]
# graph = [[0,1,1,0],
#          [0,1,1,0],
#          [1,1,1,0],
#          [0,0,0,0]]

# dx=[-1,1,0,0]
# dy=[0,0,-1,1]

# test = [[0]*4 for i in range(4)]
# for i in range(4):
#     for j in range(4):
#         if graph[i][j] == 1 and 0<i<4 and 0<j<4:
#             test[i][j] += 
#             for h in range(4):
#                 nx = i+dx[h]
#                 dy = j+dy[h]


#이코테 음료수 문제랑 비슷한거 같아서 잠시 이코테 문제를 풀어보기로 함
#응 못풀었고 이해 못해~ 

            